In [1]:
import pandas as pd
import numpy as np

## Pandas has two types of data structures- Series and DataFrame

In [2]:
marks = pd.Series([87,86,92,82,78])

In [3]:
marks

0    87
1    86
2    92
3    82
4    78
dtype: int64

In [4]:
marks.name = "Marks in Each Subjects"

In [5]:
#The data is stored like a dictionary.
marks

0    87
1    86
2    92
3    82
4    78
Name: Marks in Each Subjects, dtype: int64

In [6]:
#Lets alter the index of marks
marks.index = ['English','Science','Mathematics','Geography','History']

In [7]:
marks

English        87
Science        86
Mathematics    92
Geography      82
History        78
Name: Marks in Each Subjects, dtype: int64

In [9]:
#Also now
fruits = pd.Series({
    'apple':5,
    'banana':12,
    'mango':10
})

In [11]:
fruits.name = "Number of fruits in refrigerator"

In [12]:
fruits

apple      5
banana    12
mango     10
Name: Number of fruits in refrigerator, dtype: int64

In [13]:
fruits['apple']

5

In [14]:
marks['English']

87

In [16]:
marks.iloc[0]

87

In [18]:
marks.iloc[[0,2]]

English        87
Mathematics    92
Name: Marks in Each Subjects, dtype: int64

In [19]:
fruits + 6

apple     11
banana    18
mango     16
Name: Number of fruits in refrigerator, dtype: int64

In [20]:
fruits

apple      5
banana    12
mango     10
Name: Number of fruits in refrigerator, dtype: int64

In [22]:
# I ate one of each fruit so
fruits - 1

apple      4
banana    11
mango      9
Name: Number of fruits in refrigerator, dtype: int64

In [23]:
marks[marks>90]

Mathematics    92
Name: Marks in Each Subjects, dtype: int64

In [24]:
marks[marks>80]

English        87
Science        86
Mathematics    92
Geography      82
Name: Marks in Each Subjects, dtype: int64

In [25]:
marks>80

English         True
Science         True
Mathematics     True
Geography       True
History        False
Name: Marks in Each Subjects, dtype: bool

So we used the above booleans to filter out elements

In [32]:
marks[(marks > marks.mean())| (marks <80)]

English        87
Science        86
Mathematics    92
History        78
Name: Marks in Each Subjects, dtype: int64

In [33]:
marks[(marks > 80) & (marks <90)]

English      87
Science      86
Geography    82
Name: Marks in Each Subjects, dtype: int64

In [34]:
#My new marks
marks['English'] = 85

In [35]:
marks

English        85
Science        86
Mathematics    92
Geography      82
History        78
Name: Marks in Each Subjects, dtype: int64

In [36]:
marks[marks < 80] = 99

In [37]:
marks

English        85
Science        86
Mathematics    92
Geography      82
History        99
Name: Marks in Each Subjects, dtype: int64

# DataFrame
It looks like a normal tables.

In [39]:
data = {'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
        'city': ['Mexico City', 'Toronto', 'Prague', 'Shanghai','Manchester', 'Cairo', 'Osaka'],
        'age': [41, 28, 33, 34, 38, 31, 37],
        'marks': [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0]
       }

In [40]:
values = pd.DataFrame(data)

In [41]:
values

     name         city  age  marks
0  Xavier  Mexico City   41   88.0
1     Ann      Toronto   28   79.0
2    Jana       Prague   33   81.0
3      Yi     Shanghai   34   80.0
4   Robin   Manchester   38   68.0
5    Amal        Cairo   31   61.0
6    Nori        Osaka   37   84.0